;--------------------------------------------------
;---------------- Upgrade Templates ---------------
;--------------------------------------------------
[FreeFireUpgrade_Bsc_OVERIDE X2WeaponUpgradeTemplate]
FriendlyName="微力扳机"
FriendlyNamePlural="微力扳机"
BriefSummary="开火时，如果第一枪未命中，则士兵有15%几率射击第二枪。"
TinySummary="如果第一枪未命中，给第二枪的机会。"
LootTooltip="此武器升级，给予15%的几率。使在开火时，如果第一枪未命中，将射击第二枪。"

[FreeFireUpgrade_Adv_OVERIDE X2WeaponUpgradeTemplate]
FriendlyName="高级微力扳机"
FriendlyNamePlural="高级微力扳机"
BriefSummary="开火时，如果第一枪未命中，则士兵有30%几率射击第二枪。"
TinySummary="如果第一枪未命中，给第二枪的机会。"
LootTooltip="此武器升级，给予30%的几率。使在开火时，如果第一枪未命中，将射击第二枪。"

[FreeFireUpgrade_Sup_OVERIDE X2WeaponUpgradeTemplate]
FriendlyName="终极微力扳机"
FriendlyNamePlural="终极微力扳机"
BriefSummary="开火时，如果第一枪未命中，则士兵有45%几率射击第二枪。"
TinySummary="如果第一枪未命中，给第二枪的机会。"
LootTooltip="此武器升级，给予45%的几率。使在开火时，如果第一枪未命中，将射击第二枪。"

[CritUpgrade_Bsc_OVERIDE X2WeaponUpgradeTemplate]
FriendlyName="激光瞄准器"
FriendlyNamePlural="激光瞄准器"
BriefSummary="增加暴击几率 +<Ability:CRITINCREASE/>%，随着距离目标的接近而进一步提高。此插件的缺点是对中远程目标会有命中惩罚。"
TinySummary="增加致命一击几率，但在中远程距离有命中惩罚。"
LootTooltip="此武器升级，增加其安装的任何武器的暴击几率。"

[CritUpgrade_Adv_OVERIDE X2WeaponUpgradeTemplate]
FriendlyName="高级激光瞄准器"
FriendlyNamePlural="高级激光瞄准器"
BriefSummary="增加暴击几率 +<Ability:CRITINCREASE/>%，随着距离目标的接近而进一步提高。此插件的缺点是对中远程目标会有命中惩罚。"
TinySummary="增加致命一击几率，但在中远程距离有命中惩罚。"
LootTooltip="此武器升级，增加其安装的任何武器的暴击几率。"

[CritUpgrade_Sup_OVERIDE X2WeaponUpgradeTemplate]
FriendlyName="终极激光瞄准器"
FriendlyNamePlural="终极激光瞄准器"
BriefSummary="增加暴击几率 +<Ability:CRITINCREASE/>%，随着距离目标的接近而进一步提高。此插件的缺点是对中远程目标会有命中惩罚。"
TinySummary="增加致命一击几率，但在中远程距离有命中惩罚。"
LootTooltip="此武器升级，增加其安装的任何武器的暴击几率。"

[MissDamageUpgrade_Bsc_OVERIDE X2WeaponUpgradeTemplate]
FriendlyName="枪托"
FriendlyNamePlural="枪托"
BriefSummary="增加10点反应射击的命中率。"
TinySummary="增加10点反应射击的命中率。"
LootTooltip="此武器升级，增加10点反应射击的命中几率。"

[MissDamageUpgrade_Adv_OVERIDE X2WeaponUpgradeTemplate]
FriendlyName="高级枪托"
FriendlyNamePlural="高级枪托"
BriefSummary="增加15点反应射击的命中率。"
TinySummary="增加15点反应射击的命中率。"
LootTooltip="此武器升级，增加15点反应射击的命中几率。"

[MissDamageUpgrade_Sup_OVERIDE X2WeaponUpgradeTemplate]
FriendlyName="终极枪托"
FriendlyNamePlural="终极枪托"
BriefSummary="增加20点反应射击的命中率。"
TinySummary="增加20点反应射击的命中率。"
LootTooltip="此武器升级，增加20点反应射击的命中几率。"

[AimUpgrade_Bsc_OVERIDE X2WeaponUpgradeTemplate]
FriendlyName="瞄准镜"
FriendlyNamePlural="瞄准镜"
BriefSummary="更改射程表，对远程目标有命中奖励，但在近距离有命中惩罚。"
TinySummary="提高远程瞄准命中。"
LootTooltip="此武器升级，为其安装的任何武器提高瞄准命中加成。"

[AimUpgrade_Adv_OVERIDE X2WeaponUpgradeTemplate]
FriendlyName="高级瞄准器"
FriendlyNamePlural="高级瞄准器"
BriefSummary="更改射程表，对远程目标有命中奖励，但在近距离有命中惩罚。"
TinySummary="提高远程瞄准命中。"
LootTooltip="此武器升级，为其安装的任何武器提高瞄准命中加成。"

[AimUpgrade_Sup_OVERIDE X2WeaponUpgradeTemplate]
FriendlyName="终极瞄准镜"
FriendlyNamePlural="终极瞄准镜"
BriefSummary="更改射程表，对远程目标有命中奖励，但在近距离有命中惩罚。"
TinySummary="提高远程瞄准命中。"
LootTooltip="此武器升级，为其安装的任何武器提高瞄准命中加成。"

[ReloadUpgrade_Bsc_OVERIDE X2WeaponUpgradeTemplate]
FriendlyName="自动装填器"
FriendlyNamePlural="自动装填器"
BriefSummary="每回合免费自动装填1枚子弹，最多免费4回合。"
TinySummary="每回合免费自动装填1枚子弹，最多免费4回合。"
LootTooltip="此武器升级，提供每回合免费自动装填1枚子弹，最多免费4回合。"

[ReloadUpgrade_Adv_OVERIDE X2WeaponUpgradeTemplate]
FriendlyName="高级自动装填器"
FriendlyNamePlural="高级自动装填器"
BriefSummary="每回合免费自动装填1枚子弹，最多免费6回合。"
TinySummary="每回合免费自动装填1枚子弹，最多免费6回合。"
LootTooltip="此武器升级，提供每回合免费自动装填1枚子弹，最多免费6回合。"

[ReloadUpgrade_Sup_OVERIDE X2WeaponUpgradeTemplate]
FriendlyName="终极自动装填器"
FriendlyNamePlural="终极自动装填器"
BriefSummary="每回合免费自动装填1枚子弹，最多免费8回合。"
TinySummary="每回合免费自动装填1枚子弹，最多免费8回合。"
LootTooltip="此武器升级，提供每回合免费自动装填1枚子弹，最多免费8回合。"
;--------------------------------------------------
;-------------------- Abilities -------------------
;--------------------------------------------------

[OpticScopeRangeModifier X2AbilityTemplate]
LocFriendlyName="光学瞄准"
LocHelpText="将射程提高一个量级。"

[Scope_EU_Bsc_Ability X2AbilityTemplate]
LocFriendlyName="瞄准"
LocLongDescription="用主武器射击+5命中（排除反应射击）。还将武器射程表提高一个量级。"
LocHelpText="瞄准：命中奖励（排除反应射击）"
LocFlyOverText="瞄准"

[Scope_EU_Adv_Ability X2AbilityTemplate]
LocFriendlyName="高级瞄准"
LocLongDescription="用主武器射击+10命中（排除反应射击）。还将武器射程表提高一个量级。"
LocHelpText="瞄准：命中奖励（排除反应射击）。同时将武器射程表提高一个量级。"
LocFlyOverText="高级瞄准"

[Scope_EU_Sup_Ability X2AbilityTemplate]
LocFriendlyName="终极瞄准"
LocLongDescription="用主武器射击+10命中（排除反应射击）。还将武器射程表提高一个量级。"
LocHelpText="瞄准：命中奖励（排除反应射击）。同时将武器射程表提高一个量级。"
LocFlyOverText="终极瞄准"

[AutoLoader_EU_Bsc_Ability X2AbilityTemplate]
LocFriendlyName="自动装填：免费重新装填"
LocLongDescription="重新装填有20%几率退还一个行动点。"
LocHelpText="自动装填：重新装填有20%几率退还一个行动点。"
LocFlyOverText="自动装填"

[AutoLoader_EU_Adv_Ability X2AbilityTemplate]
LocFriendlyName="高级自动装填：免费重新装填"
LocLongDescription="重新装填有40%几率退还一个行动点。"
LocHelpText="自动装填：重新装填有40%几率退还一个行动点。"
LocFlyOverText="高级自动装填"

[AutoLoader_EU_Sup_Ability X2AbilityTemplate]
LocFriendlyName="终极自动装填：免费重新装填"
LocLongDescription="重新装填有60%几率退还一个行动点。"
LocHelpText="自动装填：重新装填有60%几率退还一个行动点。"
LocFlyOverText="终极自动装填"

[Hair_Trigger_EU_Bsc_Ability X2AbilityTemplate]
LocFriendlyName="微力扳机射击"
LocHelpText="如果第一枪未命中，射击第二枪的几率有50%，同时提高命中率10%。"

[Hair_Trigger_EU_Adv_Ability X2AbilityTemplate]
LocFriendlyName="高级微力扳机射击"
LocHelpText="如果第一枪未命中，射击第二枪的几率有70%，同时提高命中率15%。"

[Hair_Trigger_EU_Sup_Ability X2AbilityTemplate]
LocFriendlyName="终极微力扳机射击"
LocHelpText="如果第一枪未命中，射击第二枪的几率有90%，同时提高命中率20%。"

[LaserSight_EU_Bsc_Ability X2AbilityTemplate]
LocFriendlyName="激光瞄准"

[LaserSight_EU_Adv_Ability X2AbilityTemplate]
LocFriendlyName="高级激光瞄准"

[LaserSight_EU_Sup_Ability X2AbilityTemplate]
LocFriendlyName="终极激光瞄准"

